
// Реалізація плавного скролу для односторінкового лендінга. Працює при натисканні на посилання, де в атрибуті href є якорі. Плавність працює як при скролі вниз, так и вверх по сторінці. Змінна fixed_offset має значення відступу - при значенні нуль користувача буде скролити чітко на початок вказаного елемента. 

$(function () {
    $("body").on('click', '[href*="#"]', function (e) {
        var fixed_offset = 100;
        $('html,body').stop().animate({ scrollTop: $(this.hash).offset().top - fixed_offset }, 800);
        e.preventDefault();
    });
});