

// беремо клас елемента, який має отримувати додатковий клас. У нашому випадку це .header. Можна підставити свій. Елемент приходить в змінну stickeheader.
var stickyHeader = $(".header");


// Створюємо змінну зі значенням скролла. Якщо користувач проскролив на 1 піксель - спрацює функція та дод. клас буде додаватись. Значення пишеться у пікселях, можна підставити своє значення.
var scrollChange = 1;


// далее пишемо функцію
$(window).scroll(function () {


  // створюємо змінну scroll, яка буде говорити, чи почав користувач скролити
  var scroll = $(window).scrollTop();


  // якщо користувач почав скролити
  if (scroll >= scrollChange) {

    // елемент stickyHeader отримуює додатковий клас
    stickyHeader.addClass('fixed');

  } else {
    // якщо користувач знову повернувся до верху екрана на початкову позицію

    // елемент stickyHeader втрачає додатковий клас
    stickyHeader.removeClass("fixed");
  }
});